# !/bin/bash

# 第一部分：上下班時間打卡規範
dialog --title "(一)打卡規範" --msgbox "\n\n1、員工必須準時到崗位上，並在規定時間內打卡。\n\n\n
2、上班打卡時間為公司規定的上班時間開始時刻，下班打卡時間為規定的下班時間結束時刻。
\n\n\n3、必須使用公司指定的打卡系統進行打卡記錄，如有異常情況需及時與主管溝通並做記錄。" 20 90

# 第二部分：請假規範
dialog --title "(二)請假規範" --msgbox "\n\n1、員工如需請假，必須提前向主管或人事部門提交書面請假申請，註明請假時間及事由。\n\n\n
2、請假超過三天需提前七個工作日提交請假申請，並獲得主管或人事部門的批准。\n\n\n3、未經批准或擅自缺勤者，將按公司規定進行相應處罰。" 20 90

# 第三部分：獎懲制度
dialog --title "(三)獎懲制度" --msgbox "\n                       公司將根據員工的工作表現和行為進行獎懲。\n\n\n1、優秀表現包括但不限於工作成績突出、創新能力突出、團隊合作突出等，將給予表揚、獎金或晉升等獎勵。
\n\n\n2、行為不端包括但不限於違反公司規定、工作失職、遲到早退、曠職、嚴重失誤等，將受到警告、罰款、降職甚至解雇等處罰。\n\n\n3、公司將公平、公正地執行獎懲制度，確保員工權益和公司利益的平衡。" 20 90

# 第四部分：保密協議規範
dialog --title "(四)保密協議規範" --msgbox "\n\n1、員工必須嚴格遵守公司的保密協議，並對其所知悉的公司機密信息負有保密義務。
\n\n\n2、未經授權，員工不得向任何第三方透露公司的機密信息，包括但不限於客戶資訊、業務計畫、商業策略、技術資料等。\n\n\n3、員工僅在履行工作職責的必要範圍內使用機密信息，不得擅自使用或洩露。
\n\n\n4、當員工離職或輪調時，應立即歸還公司的一切機密資料，並確保已刪除或銷毀任何可能泄漏機密信息的文件或電子記錄。\n\n\n5、員工應定期接受保密培訓，加強對保密政策的理解和遵守。
\n\n\n6、任何違反保密協議的行為都將受到嚴厲的處罰，包括但不限於停職、解雇、民事賠償等，並可能涉及法律追究。" 30 90
